## staging: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                       NAME                        |
|----------|---------------------------------------------------|
| update   | `aws_iam_policy.ecr`                              |
|          | `aws_lambda_alias.api_latest`                     |
|          | `aws_lambda_function.api`                         |
| recreate | `null_resource.api_gateway_cloudwatch_logging[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
17:58:07.411 STDOUT terraform:   ~ update in-place
17:58:07.412 STDOUT terraform: -/+ destroy and then create replacement
17:58:07.412 STDOUT terraform:  <= read (data resources)
17:58:07.412 STDOUT terraform: Terraform will perform the following actions:
17:58:07.412 STDOUT terraform:   # data.aws_iam_policy_document.ecr will be read during apply
17:58:07.412 STDOUT terraform:   # (depends on a resource or a module with changes pending)
17:58:07.412 STDOUT terraform:  <= data "aws_iam_policy_document" "ecr" {
17:58:07.412 STDOUT terraform:       + id            = (known after apply)
17:58:07.412 STDOUT terraform:       + json          = (known after apply)
17:58:07.412 STDOUT terraform:       + minified_json = (known after apply)
17:58:07.412 STDOUT terraform:       + statement {
17:58:07.412 STDOUT terraform:           + actions   = [
17:58:07.412 STDOUT terraform:               + "ecr:GetAuthorizationToken",
17:58:07.412 STDOUT terraform:             ]
17:58:07.412 STDOUT terraform:           + effect    = "Allow"
17:58:07.412 STDOUT terraform:           + resources = [
17:58:07.412 STDOUT terraform:               + "*",
17:58:07.412 STDOUT terraform:             ]
17:58:07.412 STDOUT terraform:           + sid       = "GetAuthorizationToken"
17:58:07.412 STDOUT terraform:         }
17:58:07.412 STDOUT terraform:       + statement {
17:58:07.412 STDOUT terraform:           + actions   = [
17:58:07.412 STDOUT terraform:               + "ecr:BatchCheckLayerAvailability",
17:58:07.412 STDOUT terraform:               + "ecr:BatchGetImage",
17:58:07.412 STDOUT terraform:               + "ecr:CompleteLayerUpload",
17:58:07.412 STDOUT terraform:               + "ecr:GetDownloadUrlForLayer",
17:58:07.412 STDOUT terraform:               + "ecr:InitiateLayerUpload",
17:58:07.412 STDOUT terraform:               + "ecr:PutImage",
17:58:07.412 STDOUT terraform:               + "ecr:UploadLayerPart",
17:58:07.412 STDOUT terraform:             ]
17:58:07.412 STDOUT terraform:           + effect    = "Allow"
17:58:07.412 STDOUT terraform:           + resources = [
17:58:07.412 STDOUT terraform:               + "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda",
17:58:07.412 STDOUT terraform:             ]
17:58:07.412 STDOUT terraform:           + sid       = "AllowPushPull"
17:58:07.412 STDOUT terraform:         }
17:58:07.412 STDOUT terraform:       + statement {
17:58:07.412 STDOUT terraform:           + actions   = [
17:58:07.412 STDOUT terraform:               + "lambda:GetAlias",
17:58:07.412 STDOUT terraform:               + "lambda:GetFunction",
17:58:07.412 STDOUT terraform:               + "lambda:GetFunctionConfiguration",
17:58:07.412 STDOUT terraform:               + "lambda:ListAliases",
17:58:07.412 STDOUT terraform:               + "lambda:ListVersionsByFunction",
17:58:07.413 STDOUT terraform:               + "lambda:PublishVersion",
17:58:07.413 STDOUT terraform:               + "lambda:UpdateAlias",
17:58:07.413 STDOUT terraform:               + "lambda:UpdateFunctionCode",
17:58:07.413 STDOUT terraform:             ]
17:58:07.413 STDOUT terraform:           + effect    = "Allow"
17:58:07.413 STDOUT terraform:           + resources = [
17:58:07.413 STDOUT terraform:               + "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda",
17:58:07.413 STDOUT terraform:             ]
17:58:07.413 STDOUT terraform:           + sid       = "PermissionsToUpdateFunction"
17:58:07.413 STDOUT terraform:         }
17:58:07.413 STDOUT terraform:       + statement {
17:58:07.413 STDOUT terraform:           + actions   = [
17:58:07.413 STDOUT terraform:               + "lambda:GetLayerVersion",
17:58:07.413 STDOUT terraform:             ]
17:58:07.413 STDOUT terraform:           + effect    = "Allow"
17:58:07.413 STDOUT terraform:           + resources = [
17:58:07.413 STDOUT terraform:               + "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*",
17:58:07.413 STDOUT terraform:             ]
17:58:07.413 STDOUT terraform:           + sid       = "PermissionsToDownloadNewRelicLambdaLayers"
17:58:07.413 STDOUT terraform:         }
17:58:07.413 STDOUT terraform:     }
17:58:07.413 STDOUT terraform:   # aws_iam_policy.ecr will be updated in-place
17:58:07.413 STDOUT terraform:   ~ resource "aws_iam_policy" "ecr" {
17:58:07.413 STDOUT terraform:         id               = "arn:aws:iam::239043911459:policy/ecr-api-lambda-access"
17:58:07.413 STDOUT terraform:         name             = "ecr-api-lambda-access"
17:58:07.413 STDOUT terraform:       ~ policy           = jsonencode(
17:58:07.413 STDOUT terraform:             {
17:58:07.413 STDOUT terraform:               - Statement = [
17:58:07.413 STDOUT terraform:                   - {
17:58:07.413 STDOUT terraform:                       - Action   = "ecr:GetAuthorizationToken"
17:58:07.413 STDOUT terraform:                       - Effect   = "Allow"
17:58:07.413 STDOUT terraform:                       - Resource = "*"
17:58:07.413 STDOUT terraform:                       - Sid      = "GetAuthorizationToken"
17:58:07.413 STDOUT terraform:                     },
17:58:07.413 STDOUT terraform:                   - {
17:58:07.413 STDOUT terraform:                       - Action   = [
17:58:07.413 STDOUT terraform:                           - "ecr:UploadLayerPart",
17:58:07.413 STDOUT terraform:                           - "ecr:PutImage",
17:58:07.413 STDOUT terraform:                           - "ecr:InitiateLayerUpload",
17:58:07.413 STDOUT terraform:                           - "ecr:GetDownloadUrlForLayer",
17:58:07.413 STDOUT terraform:                           - "ecr:CompleteLayerUpload",
17:58:07.413 STDOUT terraform:                           - "ecr:BatchGetImage",
17:58:07.413 STDOUT terraform:                           - "ecr:BatchCheckLayerAvailability",
17:58:07.414 STDOUT terraform:                         ]
17:58:07.414 STDOUT terraform:                       - Effect   = "Allow"
17:58:07.414 STDOUT terraform:                       - Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda"
17:58:07.414 STDOUT terraform:                       - Sid      = "AllowPushPull"
17:58:07.414 STDOUT terraform:                     },
17:58:07.414 STDOUT terraform:                   - {
17:58:07.414 STDOUT terraform:                       - Action   = [
17:58:07.414 STDOUT terraform:                           - "lambda:UpdateFunctionCode",
17:58:07.414 STDOUT terraform:                           - "lambda:UpdateAlias",
17:58:07.414 STDOUT terraform:                           - "lambda:PublishVersion",
17:58:07.414 STDOUT terraform:                           - "lambda:ListVersionsByFunction",
17:58:07.414 STDOUT terraform:                           - "lambda:ListAliases",
17:58:07.414 STDOUT terraform:                           - "lambda:GetFunctionConfiguration",
17:58:07.414 STDOUT terraform:                           - "lambda:GetFunction",
17:58:07.414 STDOUT terraform:                           - "lambda:GetAlias",
17:58:07.414 STDOUT terraform:                         ]
17:58:07.414 STDOUT terraform:                       - Effect   = "Allow"
17:58:07.414 STDOUT terraform:                       - Resource = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda"
17:58:07.414 STDOUT terraform:                       - Sid      = "PermissionsToUpdateFunction"
17:58:07.414 STDOUT terraform:                     },
17:58:07.414 STDOUT terraform:                   - {
17:58:07.414 STDOUT terraform:                       - Action   = "lambda:GetLayerVersion"
17:58:07.414 STDOUT terraform:                       - Effect   = "Allow"
17:58:07.414 STDOUT terraform:                       - Resource = "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*"
17:58:07.414 STDOUT terraform:                       - Sid      = "PermissionsToDownloadNewRelicLambdaLayers"
17:58:07.414 STDOUT terraform:                     },
17:58:07.414 STDOUT terraform:                 ]
17:58:07.414 STDOUT terraform:               - Version   = "2012-10-17"
17:58:07.414 STDOUT terraform:             }
17:58:07.414 STDOUT terraform:         ) -> (known after apply)
17:58:07.414 STDOUT terraform:         tags             = {}
17:58:07.414 STDOUT terraform:         # (7 unchanged attributes hidden)
17:58:07.414 STDOUT terraform:     }
17:58:07.414 STDOUT terraform:   # aws_lambda_alias.api_latest will be updated in-place
17:58:07.414 STDOUT terraform:   ~ resource "aws_lambda_alias" "api_latest" {
17:58:07.414 STDOUT terraform:       ~ function_version = "1742" -> (known after apply)
17:58:07.414 STDOUT terraform:         id               = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:latest"
17:58:07.415 STDOUT terraform:         name             = "latest"
17:58:07.415 STDOUT terraform:         # (5 unchanged attributes hidden)
17:58:07.415 STDOUT terraform:     }
17:58:07.415 STDOUT terraform:   # aws_lambda_function.api will be updated in-place
17:58:07.415 STDOUT terraform:   ~ resource "aws_lambda_function" "api" {
17:58:07.415 STDOUT terraform:         id                             = "api-lambda"
17:58:07.415 STDOUT terraform:       ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:1742" -> (known after apply)
17:58:07.415 STDOUT terraform:       ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:1742/invocations" -> (known after apply)
17:58:07.415 STDOUT terraform:         tags                           = {}
17:58:07.415 STDOUT terraform:       ~ version                        = "1742" -> (known after apply)
17:58:07.415 STDOUT terraform:         # (27 unchanged attributes hidden)
17:58:07.415 STDOUT terraform:       ~ environment {
17:58:07.415 STDOUT terraform:           ~ variables = {
17:58:07.415 STDOUT terraform:               - "NEW_RELIC_CONFIG_FILE"                  = "/app/newrelic.ini" -> null
17:58:07.415 STDOUT terraform:               + "NEW_RELIC_EXTENSION_SEND_FUNCTION_LOGS" = "true"
17:58:07.415 STDOUT terraform:               + "NEW_RELIC_LICENSE_KEY_SECRET"           = "NEW_RELIC_LICENSE_KEY"
17:58:07.415 STDOUT terraform:                 # (18 unchanged elements hidden)
17:58:07.415 STDOUT terraform:             }
17:58:07.415 STDOUT terraform:         }
17:58:07.415 STDOUT terraform:         # (4 unchanged blocks hidden)
17:58:07.415 STDOUT terraform:     }
17:58:07.415 STDOUT terraform:   # null_resource.api_gateway_cloudwatch_logging[0] must be replaced
17:58:07.415 STDOUT terraform: -/+ resource "null_resource" "api_gateway_cloudwatch_logging" {
17:58:07.415 STDOUT terraform:       ~ id       = "925401168746400121" -> (known after apply)
17:58:07.415 STDOUT terraform:       ~ triggers = { # forces replacement
17:58:07.415 STDOUT terraform:           ~ "always_run" = "2025-10-01T15:11:39Z" -> (known after apply)
17:58:07.415 STDOUT terraform:         }
17:58:07.415 STDOUT terraform:     }
17:58:07.415 STDOUT terraform: Plan: 1 to add, 3 to change, 1 to destroy.
17:58:07.415 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
17:58:07.415 STDOUT terraform: Saved the plan to: plan.tfplan
17:58:07.415 STDOUT terraform: To perform exactly these actions, run the following command to apply:
17:58:07.415 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
